In [2]:
import numpy as np,pandas as pd

In [28]:
a=pd.read_csv(r"C:\pandas files\groupbyExcercise.csv")
a

    Unnamed: 0        Date Product  Revenue  Quantity
0            0  01-01-2023       A      221         3
1            1  01-01-2023       B      111         8
2            2  02-01-2023       B      171        11
3            3  02-01-2023       A      141        15
4            4  01-02-2023       A       75         4
5            5  01-02-2023       B       90        12
6            6  02-02-2023       A       96        17
7            7  02-02-2023       B      170        10
8            8  01-03-2023       B      200        19
9            9  01-03-2023       A      120        10
10          10  02-03-2023       A      121        12
11          11  02-03-2023       B      150         5

In [29]:
a.drop(columns=['Unnamed: 0'],inplace=True)
a

          Date Product  Revenue  Quantity
0   01-01-2023       A      221         3
1   01-01-2023       B      111         8
2   02-01-2023       B      171        11
3   02-01-2023       A      141        15
4   01-02-2023       A       75         4
5   01-02-2023       B       90        12
6   02-02-2023       A       96        17
7   02-02-2023       B      170        10
8   01-03-2023       B      200        19
9   01-03-2023       A      120        10
10  02-03-2023       A      121        12
11  02-03-2023       B      150         5

In [30]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      12 non-null     object
 1   Product   12 non-null     object
 2   Revenue   12 non-null     int64
 3   Quantity  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [31]:
a.describe().T

          count        mean        std   min     25%    50%     75%    max
Revenue    12.0  138.833333  45.095522  75.0  107.25  131.0  170.25  221.0
Quantity   12.0   10.500000   5.000000   3.0    7.25   10.5   12.75   19.0

#### Arrange DataFrame df, focusing on distinct product categories. Explore the data           to reveal:
* Overall revenue insights
* Average revenue patterns
* Peak quantity sold observations
* Minimum quantity sold occurrences

In [32]:
a['Revenue'].sum()

1666

In [33]:
a.groupby(['Product'])['Revenue'].agg((np.sum))

Product
A    774
B    892
Name: Revenue, dtype: int64

In [34]:
a.groupby(['Product'])['Revenue'].agg((np.mean))

Product
A    129.000000
B    148.666667
Name: Revenue, dtype: float64

In [35]:
a.groupby(['Product'])['Revenue'].agg((np.max))

Product
A    221
B    200
Name: Revenue, dtype: int64

In [36]:
a.groupby(['Product'])['Revenue'].agg((np.min))

Product
A    75
B    90
Name: Revenue, dtype: int64

### Aggregate DataFrame df by extracting the month and year from the 'Date' column. Calculate the collective revenue for each unique combination of month and year.

In [92]:
a['Date'] = pd.to_datetime(a['Date'])
a['Month'] = a['Date'].dt.month
a['Year'] = a['Date'].dt.year
a[['Date','Month','Year']]

         Date  Month  Year
0  2023-01-01      1  2023
1  2023-01-01      1  2023
2  2023-02-01      2  2023
3  2023-02-01      2  2023
4  2023-01-02      1  2023
5  2023-01-02      1  2023
6  2023-02-02      2  2023
7  2023-02-02      2  2023
8  2023-01-03      1  2023
9  2023-01-03      1  2023
10 2023-02-03      2  2023
11 2023-02-03      2  2023

In [93]:
x =a.groupby(['Month', 'Year'])['Revenue'].sum()
print(x)

Month  Year
1      2023    817
2      2023    849
Name: Revenue, dtype: int64

### Group the DataFrame df by the 'Date' column and find the date with the highest total revenue and the date with the highest total quantity sold.

In [49]:
a.groupby(['Date'])[['Revenue','Quantity']].sum()

            Revenue  Quantity
Date
01-01-2023      332        11
01-02-2023      165        16
01-03-2023      320        29
02-01-2023      312        26
02-02-2023      266        27
02-03-2023      271        17

### Group the DataFrame df by the Date and find products that have a total quantity sold greater than 10 and less than 15 .

In [70]:
c=a.groupby(['Date','Product'])['Quantity'].sum()
print(c)

Date        Product
01-01-2023  A           3
            B           8
01-02-2023  A           4
            B          12
01-03-2023  A          10
            B          19
02-01-2023  A          15
            B          11
02-02-2023  A          17
            B          10
02-03-2023  A          12
            B           5
Name: Quantity, dtype: int64

In [72]:
b=c[(c > 10 )& (c < 15)]
print(b)

Date        Product
01-02-2023  B          12
02-01-2023  B          11
02-03-2023  A          12
Name: Quantity, dtype: int64